import logging
from typing import Dict, List

class GroupSelectionData:
    def __init__(self):
        self.groups_data = {
            "1 курс": [
                {"name": "БДД-101", "id": "26627"},
                {"name": "БДД-102", "id": "26640"},
                {"name": "ИД-101", "id": "26616"},
                {"name": "ИСПД-101", "id": "26628"},
                {"name": "ИСПД-102", "id": "26629"},
                {"name": "ИСПД-103", "id": "26639"},
                {"name": "МД-101", "id": "26615"},
                {"name": "РД-101", "id": "26630"},
                {"name": "РД-102", "id": "26806"},
                {"name": "РСОД-101", "id": "26617"},
                {"name": "УПД-101", "id": "26618"},
                {"name": "ЭБД-101", "id": "26626"},
                {"name": "ЭБД-102", "id": "26807"},
                {"name": "ЭД-101", "id": "26619"},
                {"name": "ЮД-101", "id": "26785"},
            ],
            "2 курс": [
                {"name": "БДД-201", "id": "26641"},
                {"name": "БДД-202", "id": "26642"},
                {"name": "ИД-201ис", "id": "26582"},
                {"name": "ИСПД-201", "id": "26643"},
                {"name": "ИСПД-202", "id": "26644"},
                {"name": "ИСПД-203", "id": "26646"},
                {"name": "РД-201", "id": "26658"},
                {"name": "РСОД-201", "id": "26583"},
                {"name": "УПД-201", "id": "26585"},
                {"name": "ЭБД-201", "id": "26646"},
                {"name": "ЭД-201бу", "id": "26587"},
            ],
            "3 курс": [
                {"name": "БДД-301", "id": "26648"},
                {"name": "ИД-301кис", "id": "26584"},
                {"name": "ИСПД-301", "id": "26653"},
                {"name": "МД-301мо", "id": "26586"},
                {"name": "РСОД-301", "id": "26588"},
                {"name": "УПД-301", "id": "26593"},
                {"name": "ЭБД-301", "id": "26654"},
                {"name": "ЭД-301эпо", "id": "26595"},
            ],
            "4 курс": [
                {"name": "ИД-401кис", "id": "26589"},
                {"name": "РСОД-401", "id": "26890"},
                {"name": "УПД-401", "id": "26591"},
                {"name": "ЭД-401эпо", "id": "26592"},
            ]
        }
        logging.info("GroupSelectionData initialized")

    def get_courses(self) -> List[str]:
        """Возвращает список курсов"""
        return list(self.groups_data.keys())

    def get_groups_for_course(self, course: str) -> List[Dict]:
        """Возвращает список групп для курса"""
        return self.groups_data.get(course, [])